# HandrailSupportsLayoutParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..HandrailSupportsLayoutParam Property
ParameterTypeId Class See Also
---
"Layout"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId HandrailSupportsLayoutParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HandrailSupportsLayoutParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ HandrailSupportsLayoutParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace